In [1]:
import seaborn as sns
import numpy as np
import pandas as pd

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
print(titanic.head(10))
titanic.shape

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

(891, 15)

In [4]:
# categorical convierte a factor como en R 
titanic['survived'] = pd.Categorical(titanic['survived'])

In [5]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])
titanic['sex'] = pd.Categorical(titanic['sex'])

In [6]:
# notar que tienen NaN
titanic['deck'] = pd.Categorical(titanic['deck'])

## tabla de contigencia de una variable

In [7]:
tab1 = pd.crosstab(index = titanic['survived'],
                  columns = "pasajeros")
tab1

col_0     pasajeros
survived
0               549
1               342

In [8]:
tab2 = pd.crosstab(index = titanic['pclass'],
                  columns = "pasajeros")
tab2

col_0   pasajeros
pclass
1             216
2             184
3             491

In [9]:
tab3 = pd.crosstab(index = titanic['sex'],
                  columns = "pasajeros")
tab3

col_0   pasajeros
sex
female        314
male          577

In [10]:
# Nan no son contados
tab4 = pd.crosstab(index = titanic['deck'],
                  columns = "pasajeros")
tab4

col_0  pasajeros
deck
A             15
B             47
C             59
D             33
E             32
F             13
G              4

In [11]:
# verificacion, son menos que total de rows
print(tab4.sum())
print(tab2.sum())

col_0
pasajeros    203
dtype: int64
col_0
pasajeros    891
dtype: int64

# extrayendo subtablas

In [12]:
#iloc es con indice y loc con nombre
tab4.iloc[1:5]

col_0  pasajeros
deck
B             47
C             59
D             33
E             32

# tablas relativas

In [13]:
tab4/tab4.sum()

col_0  pasajeros
deck
A       0.073892
B       0.231527
C       0.290640
D       0.162562
E       0.157635
F       0.064039
G       0.019704

In [14]:
tab2/tab2.sum()

col_0   pasajeros
pclass
1        0.242424
2        0.206510
3        0.551066

In [15]:
tab1/tab1.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838